PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    if (len > 0 && len < 512) {
        // Publicar en tópico individual (para la VM)
        char individual_topic[128];
        snprintf(individual_topic, sizeof(individual_topic), "clients/unknown/panels/unknown");
        
        esp_err_t ret = mqtt_manager_publish_json(individual_topic, json_buffer, 1, false);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "Relay %s state change published: %s -> %s", 
                    event->relay_id,
                    (event->old_state == RELAY_STATE_OK) ? "OK" : "DISC",
                    (event->new_state == RELAY_STATE_OK) ? "OK" : "DISC");
        } else {
            ESP_LOGW(TAG, "Failed to publish relay event: %s", esp_err_to_name(ret));
        }
    } else {
        ESP_LOGE(TAG, "Relay event JSON too large or formatting error");
    }
    
    // CRÍTICO: Limpiar y liberar buffer inmediatamente
    memset(json_buffer, 0, 512);
    free(json_buffer);
    json_buffer = NULL;
    
    // Forzar compactación del heap para evitar fragmentación
    heap_caps_check_integrity_all(true);
}

// Callback para comandos MQTT de configuración de relays
static esp_err_t relay_mqtt_command_callback(const char *topic, const char *command_json, void *user_data) {
    ESP_LOGI(TAG, "Processing relay MQTT command from topic: %s", topic);
    ESP_LOGI(TAG, "Command JSON: %s", command_json);
    
    // Reportar actividad al watchdog
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    // El comando ya fue procesado por relay_manager_process_mqtt_command
    // Aquí podemos enviar respuesta de confirmación si es necesario
    
    return ESP_OK;
}

// Callback MQTT simplificado
static void mqtt_state_callback(mqtt_manager_state_t state, void *user_data) {
    switch (state) {
        case MQTT_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            g_mqtt_connected = true;
            
            // Inicializar relay manager cuando MQTT se conecta por primera vez
            if (!g_relay_manager_initialized) {
                ESP_LOGI(TAG, "Initializing Relay Manager after MQTT connection");
                esp_err_t ret = relay_manager_init();
                if (ret == ESP_OK) {
                    // Configurar callbacks
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    
                    // Forzar verificación inicial de estados
                    relay_manager_check_all_states(true);
                    
                    g_relay_manager_initialized = true;
                    ESP_LOGI(TAG, "Relay Manager initialized successfully");
                } else {
                    ESP_LOGE(TAG, "Failed to initialize Relay Manager: %s", esp_err_to_name(ret));
                }
            }
            
            // Reportar actividad MQTT (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                
                // Cambiar a modo running cuando MQTT esté conectado
                if (g_wifi_connected && g_mqtt_connected) {
                    watchdog_manager_set_mode(WATCHDOG_MODE_RUNNING);
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "MQTT disconnected");
            g_mqtt_connected = false;
            
            // Volver a modo config si perdemos MQTT (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_ERROR:
            ESP_LOGW(TAG, "MQTT error");
            g_mqtt_connected = false;
            break;
            
        default:
            break;
    }
}

// Callback mensajes MQTT simplificado
static void mqtt_message_callback(const char *topic, const char *data, int data_len, void *user_data) {
    ESP_LOGI(TAG, "MQTT message: %s (%d bytes)", topic, data_len);
    
    // Reportar actividad MQTT (solo si watchdog está disponible)
    if (g_watchdog_available) {
        esp_err_t ret = watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
        if (ret != ESP_OK) {
            ESP_LOGD(TAG, "Could not report MQTT activity to watchdog");
        }
    }
    
    // Procesar comandos de configuración de relays
    if (strstr(topic, "/relay_config") && g_relay_manager_initialized) {
        ESP_LOGI(TAG, "Relay config command received");
        esp_err_t ret = relay_manager_process_mqtt_command(data);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to process relay command: %s", esp_err_to_name(ret));
        }
    }
}

// WiFi callback con integración de watchdog
static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    char esp32_id[ESP32_ID_LENGTH + 1];
    
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            ESP_LOGI(TAG, "WiFi connected");
            g_wifi_connected = true;
            
            // Reportar actividad WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            // Sincronizar tiempo
            time_manager_sync_time();
            
            // Setup MQTT minimalista
            if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(esp32_id) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            ESP_LOGI(TAG, "WiFi disconnected");
            g_wifi_connected = false;
            g_mqtt_connected = false;
            
            // Volver a modo config al perder WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
