PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
        case WIFI_MANAGER_STATE_AP_MODE:
            ESP_LOGI(TAG, "WiFi AP mode active");
            g_wifi_connected = false;
            
            // Permanecer en modo config (solo si watchdog está disponible)
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    ESP_LOGD(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        default:
            break;
    }
}

// Callback portal cautivo simplificado
static void on_wifi_connect_callback(void *user_data) {
    ESP_LOGI(TAG, "WiFi configured via captive portal");
    
    if (wifi_captive_portal_is_active()) {
        wifi_captive_portal_stop();
        esp_wifi_set_mode(WIFI_MODE_STA);
    }
}

// CORREGIDO: Task para monitoreo del sistema
static void system_monitor_task(void *pvParameters) {
    ESP_LOGI(TAG, "System monitor task started");
    
    // Variable para saber si el watchdog manager está disponible para este task
    bool task_watchdog_available = false;
    
    // Registrar este task en el watchdog (si está disponible)
    if (g_watchdog_available) {
        esp_err_t wd_ret = watchdog_manager_register_task(NULL, "sys_monitor");
        if (wd_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in watchdog manager");
            task_watchdog_available = true;
        } else {
            ESP_LOGW(TAG, "Failed to register in watchdog manager: %s", esp_err_to_name(wd_ret));
        }
    }
    
    // Si no se pudo registrar en watchdog manager, intentar con TWDT por defecto
    if (!task_watchdog_available) {
        ESP_LOGW(TAG, "Watchdog manager not available, using default ESP-IDF TWDT");
        esp_err_t twdt_ret = esp_task_wdt_add(NULL);
        if (twdt_ret == ESP_OK) {
            ESP_LOGI(TAG, "System monitor task registered in default TWDT");
        } else {
            ESP_LOGW(TAG, "Failed to register in default TWDT: %s", esp_err_to_name(twdt_ret));
        }
    }
    
    uint32_t cycle_count = 0;
    
    while (1) {
        // Alimentar watchdog (usar el disponible)
        if (task_watchdog_available) {
            watchdog_manager_feed();
        } else {
            // Alimentar el TWDT por defecto
            esp_task_wdt_reset();
        }
        
        cycle_count++;
        
        // Verificar relays cada 5 minutos si están inicializados
        if (cycle_count % 60 == 0 && g_relay_manager_initialized) {
            ESP_LOGI(TAG, "Performing periodic relay check");
            relay_manager_check_all_states(false);
        }
        
        // Manejar network info pendiente después de NTP sync
        if (time_manager_should_send_network_info()) {
            ESP_LOGI(TAG, "Sending network info after NTP synchronization");
            esp_err_t ret = mqtt_manager_send_network_info();
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "Network info sent successfully");
                time_manager_mark_network_info_sent();
            } else {
                ESP_LOGW(TAG, "Failed to send network info: %s", esp_err_to_name(ret));
                // Reintentar en el siguiente ciclo
            }
        }
        
        // CORREGIDO: Limpieza agresiva de memoria si está baja
        size_t free_heap = esp_get_free_heap_size();
        if (free_heap < 40000) {  // Umbral más alto para prevención
            ESP_LOGW(TAG, "Low memory detected: %zu bytes - Performing emergency cleanup", free_heap);
            
            // Limpiar colas MQTT si es posible
            if (mqtt_manager_is_connected()) {
                ESP_LOGI(TAG, "Triggering MQTT memory cleanup");
                mqtt_manager_emergency_memory_cleanup();
            }
            
            // Forzar limpieza de heap
            force_heap_cleanup();
            
            size_t free_after = esp_get_free_heap_size();
            ESP_LOGI(TAG, "Memory after cleanup: %zu bytes (recovered: %d bytes)", 
                    free_after, (int)(free_after - free_heap));
        }
        
        // NUEVO: Forzar limpieza de heap cada 30 minutos
        if (cycle_count % 360 == 0) {  // 30 minutos = 30*60/5 = 360 ciclos
            force_heap_cleanup();
        }
        
        // Memoria cada 10 minutos (reduce overhead)
        if (cycle_count % 120 == 0) {
            print_memory_info();
        }
        
        bool wifi_connected = wifi_manager_is_connected();
        bool mqtt_connected = mqtt_manager_is_connected();
        
        // Actualizar estado global
        g_wifi_connected = wifi_connected;
        g_mqtt_connected = mqtt_connected;
        
        if (wifi_connected) {
            // Reportar actividad WiFi (solo si watchdog está disponible)
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            // Cambiar a modo STA si es necesario
            wifi_mode_t mode;
            if (esp_wifi_get_mode(&mode) == ESP_OK && mode == WIFI_MODE_APSTA) {
                esp_wifi_set_mode(WIFI_MODE_STA);
            }
            
            // Verificar tiempo - CON MANEJO DE ERRORES MEJORADO
            if (!time_manager_is_synchronized()) {
                esp_err_t time_ret = time_manager_check_sync();
                if (time_ret != ESP_OK && time_ret != ESP_ERR_NOT_FINISHED) {
                    ESP_LOGD(TAG, "Time sync check result: %s", esp_err_to_name(time_ret));
                }
            }
            
            // Procesar MQTT - CON VERIFICACIÓN DE MEMORIA
            if (free_heap > 30000) {  // Solo procesar MQTT si hay suficiente memoria
                esp_err_t mqtt_ret = mqtt_manager_loop(0);
                if (mqtt_ret != ESP_OK) {
                    ESP_LOGD(TAG, "MQTT loop result: %s", esp_err_to_name(mqtt_ret));
                }
            } else {
                ESP_LOGW(TAG, "Skipping MQTT loop due to low memory: %zu bytes", free_heap);
            }
            
