PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
            if (mqtt_connected) {
                // Reportar actividad MQTT (solo si watchdog está disponible)
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                // Log cada 2 minutos cuando todo OK
                if (cycle_count % 24 == 0) {
                    char time_str[32];
                    if (time_manager_get_lima_time_str(time_str, sizeof(time_str)) == ESP_OK) {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected, Time: %s", time_str);
                    } else {
                        ESP_LOGI(TAG, "System OK - WiFi+MQTT connected");
                    }
                }
            } else {
                // Reintentar MQTT cada 2 minutos - SOLO SI HAY SUFICIENTE MEMORIA
                if (cycle_count % 24 == 0 && free_heap > 50000) {
                    ESP_LOGI(TAG, "Retrying MQTT connection");
                    char esp32_id[ESP32_ID_LENGTH + 1];
                    if (esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(esp32_id);
                        mqtt_manager_connect();
                    }
                } else if (free_heap <= 50000) {
                    ESP_LOGW(TAG, "Skipping MQTT reconnect due to low memory: %zu bytes", free_heap);
                }
            }
        } else {
            // WiFi desconectado - verificar recovery
            if (cycle_count % 12 == 0) {
                ESP_LOGI(TAG, "WiFi disconnected - attempting recovery");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 3);
            }
        }
        
        // Verificar salud del sistema (solo si watchdog está disponible)
        if (g_watchdog_available) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                ESP_LOGW(TAG, "System health degraded: %d", health);
            }
        }
        
        // Pausa optimizada
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");

    // === FASE 1: Inicialización básica ===
    ESP_LOGI(TAG, "Phase 1: Basic initialization");
    
    // Inicializar watchdog con manejo robusto de errores
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        // Si falla la inicialización del watchdog, intentar una vez más después de delay
        ESP_LOGW(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(2000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            ESP_LOGE(TAG, "Watchdog initialization failed twice, continuing without custom watchdog manager");
            ESP_LOGI(TAG, "System will use default ESP-IDF TWDT");
            g_watchdog_available = false;
        } else {
            ESP_LOGI(TAG, "Watchdog manager initialized on second attempt");
            g_watchdog_available = true;
            
            // Configurar callback del watchdog
            watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
            
            // Registrar task principal
            esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
            if (reg_ret != ESP_OK) {
                ESP_LOGW(TAG, "Failed to register main task in watchdog: %s", esp_err_to_name(reg_ret));
            }
        }
    } else {
        ESP_LOGI(TAG, "Watchdog manager initialized successfully");
        g_watchdog_available = true;
        
        // Configurar callback del watchdog
        watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
        
        // Registrar task principal
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to register main task in watchdog: %s", esp_err_to_name(reg_ret));
        }
    }
    
    // Alimentar watchdog inicialmente (solo si se inicializó correctamente)
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // Continuar con el resto de la inicialización...
    ESP_ERROR_CHECK(config_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_id(esp32_id, sizeof(esp32_id)));
    ESP_LOGI(TAG, "ESP32 ID: %s", esp32_id);
    
    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    ESP_LOGI(TAG, "MAC: %s", mac_address);
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 2: Inicialización de managers ===
    ESP_LOGI(TAG, "Phase 2: Manager initialization");
    
    ESP_ERROR_CHECK(wifi_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(time_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(mqtt_manager_init());
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 3: Configuración de callbacks ===
    ESP_LOGI(TAG, "Phase 3: Callback configuration");
    
    ESP_ERROR_CHECK(wifi_manager_set_state_callback(wifi_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_state_callback(mqtt_state_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_message_callback(mqtt_message_callback, NULL));
    ESP_ERROR_CHECK(mqtt_manager_set_esp32_id(esp32_id));
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 4: Conexión WiFi ===
    ESP_LOGI(TAG, "Phase 4: WiFi connection");
    
