PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    // Intentar conexión WiFi guardada
    esp_err_t wifi_ret = wifi_manager_connect_saved();
    if (wifi_ret != ESP_OK) {
        // Iniciar portal cautivo
        char ap_ssid[33];
        ESP_ERROR_CHECK(wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), "FirePanel"));
        
        ESP_LOGI(TAG, "Starting captive portal: %s", ap_ssid);
        ESP_ERROR_CHECK(wifi_captive_portal_start(ap_ssid, "firepanel"));
        ESP_ERROR_CHECK(wifi_captive_portal_set_on_connect_callback(on_wifi_connect_callback, NULL));
        
        // Permanecer en modo config
        if (g_watchdog_available) {
            watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
        }
    } else {
        // WiFi conectado, iniciar servicios
        if (wifi_manager_is_connected()) {
            g_wifi_connected = true;
            time_manager_sync_time();
            mqtt_manager_connect();
        }
    }
    
    if (g_watchdog_available) {
        watchdog_manager_feed();
    }
    
    // === FASE 5: Crear task de monitoreo ===
    ESP_LOGI(TAG, "Phase 5: Creating system monitor task");
    
    BaseType_t xReturned = xTaskCreate(
        system_monitor_task,
        "sys_monitor",
        8192,  // Stack size
        NULL,
        5,     // Priority
        NULL
    );
    
    if (xReturned != pdPASS) {
        ESP_LOGE(TAG, "Failed to create system monitor task");
        if (g_watchdog_available) {
            watchdog_manager_force_reset("task_creation_failed");
        } else {
            esp_restart();
        }
    }
    
    g_system_initialized = true;
    ESP_LOGI(TAG, "System initialization completed successfully");
    
    // === LOOP PRINCIPAL SIMPLIFICADO ===
    // El task principal ahora solo maneja el watchdog y tareas críticas
    uint32_t main_cycle = 0;
    
    while (1) {
        // Alimentar watchdog del task principal (solo si está inicializado)
        if (g_watchdog_available) {
            watchdog_manager_feed();
        } else {
            // Usar TWDT por defecto si está disponible
            esp_task_wdt_reset();
        }
        
        main_cycle++;
        
        // Verificaciones críticas cada minuto
        if (main_cycle % 12 == 0) {
            // Verificar salud del watchdog (solo si está inicializado)
            if (g_watchdog_available) {
                uint32_t feed_count, error_count;
                const char *last_reset_reason;
                
                if (watchdog_manager_get_stats(&feed_count, &error_count, &last_reset_reason) == ESP_OK) {
                    if (error_count > 0) {
                        ESP_LOGW(TAG, "Watchdog errors detected: %lu (last reset: %s)", 
                                error_count, last_reset_reason ? last_reset_reason : "none");
                    }
                }
                
                // Verificar modo del watchdog
                watchdog_mode_t current_mode = watchdog_manager_get_mode();
                if (current_mode == WATCHDOG_MODE_CRITICAL) {
                    ESP_LOGW(TAG, "System running in CRITICAL mode");
                }
            }
        }
        
        // Verificación de memoria cada 5 minutos
        if (main_cycle % 60 == 0) {
            size_t free_heap = esp_get_free_heap_size();
            if (free_heap < 30000) {
                ESP_LOGW(TAG, "Main task: Low memory detected: %zu bytes", free_heap);
            }
        }
        
        // El task principal ahora tiene un ciclo más rápido para mejor responsividad del watchdog
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
    
    // En caso de salida del while (que no debería pasar), limpiar recursos
    if (g_relay_manager_initialized) {
        ESP_LOGI(TAG, "Cleaning up Relay Manager");
        relay_manager_deinit();
        g_relay_manager_initialized = false;
    }
}